Examples/groovyBC/jumpChannel/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices        
(
    (0 0 0)
    (10 0 0)
    (10 1 0)
    (0 1 0)
    (0 0 0.1)
    (10 0 0.1)
    (10 1 0.1)
    (0 1 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (200 20 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary         
(
    walls
    {
        type walls;
        faces
            (
                (3 7 6 2)
                (1 5 4 0)
            );
    }
    inlet
    {
        type patch;
        faces
            (
                (0 4 7 3)
            );
    }
    outlet
    {
        type patch;
        faces
            (
                (2 6 5 1)
            );
    }
    frontAndBack 
    {
        type empty;
        faces
            (
                (0 3 2 1)
                (4 5 6 7)
            );
    }
    jump1_master
    {
        type cyclic;
        faces ();
        neighbourPatch jump1_slave;
    }
    jump1_slave
    {
        type cyclic;
        faces ();
        neighbourPatch jump1_master;
    }
    jump2_master
    {
        type cyclic;
        faces ();
        neighbourPatch jump2_slave;
    }
    jump2_slave
    {
        type cyclic;
        faces ();
        neighbourPatch jump2_master;
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
