Examples/groovyBC/jumpChannel/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    jump1_master
    {
        type            groovyBCJump;
        patchType       cyclic;
        jumpExpression  "(normal() & U)>0 ? -1 : 1";
        value           uniform 0;
    }
    jump1_slave
    {
        $jump1_master;
    }
    jump2_master
    {
        type            groovyBCJump;
        patchType       cyclic;
        jumpExpression  "(pos().y>0.05 ? 1 : 0)*((normal() & U)>0 ? -1 : 1)*10*mag(U)";
        value           uniform 0;
    }
    jump2_slave
    {
        $jump2_master;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
